#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/timestamp-rest-platform/timestamp-rest-platform/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/timestamp-rest-platform/timestamp-rest-platform

To view this run in a browser, visit:
https://app.terraform.io/app/jsllc/timestamp-rest-platform/runs/run-H4z5dr1Lw5TXWcTY

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
module.code_pipeline.aws_ecr_repository.default: Refreshing state... [id=tf-jsmiley-timestamp-app-0]
module.network.aws_eip.gw[0]: Refreshing state... [id=eipalloc-06986fb1bec5fdb2e]
module.code_pipeline.aws_iam_role.codebuild: Refreshing state... [id=tf-codebuild-jsmiley-timestamp-app]
module.eks_cluster.aws_iam_role.cluster: Refreshing state... [id=tf-role-eks-cluster-jsmiley-timestamp-app]
module.code_pipeline.aws_s3_bucket.codepipeline_source: Refreshing state... [id=tf-codepipeline-source-jsmiley-timestamp-app]
module.network.aws_eip.gw[1]: Refreshing state... [id=eipalloc-0a9919c7b49080d1a]
module.code_pipeline.aws_s3_bucket.codepipeline_artifacts: Refreshing state... [id=tf-codepipeline-artifacts-jsmiley-timestamp-app]
module.code_pipeline.aws_iam_role.codepipeline_role: Refreshing state... [id=test-role]
module.network.aws_vpc.default: Refreshing state... [id=vpc-0f30150f0fb69932c]
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=tf-role-eks-node-group-jsmiley-timestamp-app-0]
module.code_pipeline.aws_codebuild_project.default: Refreshing state... [id=arn:aws:codebuild:us-east-1:888458450351:project/tf-jsmiley-timestamp-app]
module.eks_cluster.aws_iam_role_policy.cluster: Refreshing state... [id=tf-role-eks-cluster-jsmiley-timestamp-app:tf-role-cluster-policy-jsmiley-timestamp-app-0]
module.eks_cluster.aws_iam_role_policy_attachment.cluster-AmazonEKSClusterPolicy: Refreshing state... [id=tf-role-eks-cluster-jsmiley-timestamp-app-20210115145255826900000001]
module.eks_cluster.aws_iam_role_policy_attachment.cluster-AmazonEKSVPCResourceController: Refreshing state... [id=tf-role-eks-cluster-jsmiley-timestamp-app-20210115145255894800000003]
module.eks_cluster.aws_iam_role_policy_attachment.node_group-AmazonEKSWorkerNodePolicy: Refreshing state... [id=tf-role-eks-node-group-jsmiley-timestamp-app-0-20210115145255983500000005]
module.eks_cluster.aws_iam_role_policy_attachment.node_group-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=tf-role-eks-node-group-jsmiley-timestamp-app-0-20210115145255868700000002]
module.eks_cluster.aws_iam_role_policy_attachment.node_group-AmazonEKS_CNI_Policy: Refreshing state... [id=tf-role-eks-node-group-jsmiley-timestamp-app-0-20210115145255955800000004]
module.network.aws_subnet.app[1]: Refreshing state... [id=subnet-01fed409e578d12b0]
module.eks_cluster.aws_security_group.eks-cluster-node: Refreshing state... [id=sg-09c2f273b280f95ba]
module.network.aws_internet_gateway.default: Refreshing state... [id=igw-02fbb44e6fcb0500f]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0573a4385ce05d480]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-00f1af250d96af70a]
module.eks_cluster.aws_security_group.eks-cluster: Refreshing state... [id=sg-0b058f4468c99cee3]
module.network.aws_subnet.app[0]: Refreshing state... [id=subnet-0a44ba06aa2dd4759]
module.code_pipeline.aws_iam_role_policy.codepipeline_policy: Refreshing state... [id=test-role:codepipeline_policy]
module.code_pipeline.aws_iam_role_policy.codebuild: Refreshing state... [id=tf-codebuild-jsmiley-timestamp-app:terraform-20210115145256262400000006]
module.code_pipeline.aws_codepipeline.default: Refreshing state... [id=tf-jsmiley-timestamp-app]
module.network.aws_nat_gateway.gw[1]: Refreshing state... [id=nat-08d287964c323e4bf]
module.network.aws_nat_gateway.gw[0]: Refreshing state... [id=nat-08dfe098ad7097b13]
module.network.aws_route_table.default: Refreshing state... [id=rtb-02f02e020e7aa5ee0]
module.eks_cluster.aws_security_group_rule.eks-cluster-ingress-node-https: Refreshing state... [id=sgrule-2356145840]
module.eks_cluster.aws_security_group_rule.eks-cluster-node-ingress-self: Refreshing state... [id=sgrule-700775844]
module.eks_cluster.aws_eks_cluster.default: Refreshing state... [id=tf-cluster-jsmiley-timestamp-app-0]
module.eks_cluster.aws_security_group_rule.eks-cluster-node-ingress-cluster: Refreshing state... [id=sgrule-1028963541]
module.network.aws_route_table_association.main[0]: Refreshing state... [id=rtbassoc-0e0dc8e1e1fc025e3]
module.network.aws_route_table_association.main[1]: Refreshing state... [id=rtbassoc-085f49f832efe9b29]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0232e811318918be4]
module.network.aws_route_table.private[1]: Refreshing state... [id=rtb-05a3921f77fcad338]
module.eks_cluster.aws_eks_node_group.default: Refreshing state... [id=tf-cluster-jsmiley-timestamp-app-0:tf-ng-jsmiley-timestamp-app-0]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02c494a844f139698]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c08d06521f4cb5be]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.deploy_app.aws_s3_bucket_object.codepipeline_source will be created
  + resource "aws_s3_bucket_object" "codepipeline_source" {
      + acl                    = "private"
      + bucket                 = "tf-codepipeline-source-jsmiley-timestamp-app"
      + content_type           = (known after apply)
      + etag                   = "9573cedaedde923312058b24118e1fc8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "timestamp-app.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./timestamp-app.zip"
      + storage_class          = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @jimRsmiley, Action: `pull_request`*